### Задание 1

# Импортируйте библиотеку Pandas и дайте ей псевдоним pd. Создайте датафрейм authors со столбцами author_id и author_name, в которых соответственно содержатся данные: [1, 2, 3] и ['Тургенев', 'Чехов', 'Островский'].
Затем создайте датафрейм book cо столбцами author_id, book_title и price, в которых соответственно содержатся данные:  
[1, 1, 1, 2, 2, 3, 3],
['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
[450, 300, 350, 500, 450, 370, 290].

In [1]:
import pandas as pd

In [2]:
a_path = './authors.csv'
a_path

'./authors.csv'

In [3]:
df_a = pd.read_csv(a_path, sep=',')
df_a

   author_id author_name
0          1    Turgenev
1          2     Chekhov
2          3  Ostrovskiy

In [4]:
b_path = './books.csv'
b_path

'./books.csv'

In [5]:
df_b = pd.read_csv(b_path, sep=',')
df_b

   author_id            book_title  price
0          1           Otsy i deti    450
1          1                 Rudin    300
2          1    Dvoryanskoe gnezdo    350
3          2       Tolsty i tonkiy    500
4          2      Dama s sobachkoi    450
5          3                 Groza    370
6          3  Talanty i poklonniki    290

### Задание 2

Получите датафрейм authors_price, соединив датафреймы authors и books по полю author_id.

In [6]:
authors_price = pd.merge(df_a, df_b, on='author_id', how='inner')
authors_price

   author_id author_name            book_title  price
0          1    Turgenev           Otsy i deti    450
1          1    Turgenev                 Rudin    300
2          1    Turgenev    Dvoryanskoe gnezdo    350
3          2     Chekhov       Tolsty i tonkiy    500
4          2     Chekhov      Dama s sobachkoi    450
5          3  Ostrovskiy                 Groza    370
6          3  Ostrovskiy  Talanty i poklonniki    290

### Задание 3

Создайте датафрейм top5, в котором содержатся строки из authors_price с пятью самыми дорогими книгами.

In [7]:
top5 = authors_price.nlargest(5, "price")
top5

   author_id author_name          book_title  price
3          2     Chekhov     Tolsty i tonkiy    500
0          1    Turgenev         Otsy i deti    450
4          2     Chekhov    Dama s sobachkoi    450
5          3  Ostrovskiy               Groza    370
2          1    Turgenev  Dvoryanskoe gnezdo    350

### Задание 4

Создайте датафрейм authors_stat на основе информации из authors_price. В датафрейме authors_stat должны быть четыре столбца:
author_name, min_price, max_price и mean_price,
в которых должны содержаться соответственно имя автора, минимальная, максимальная и средняя цена на книги этого автора.

In [8]:
authors_price["author_name"].value_counts()

Turgenev      3
Chekhov       2
Ostrovskiy    2
Name: author_name, dtype: int64

In [9]:
authors_stat1 = authors_price.groupby("author_name").agg({"price": "max"})
authors_stat1

             price
author_name
Chekhov        500
Ostrovskiy     370
Turgenev       450

In [10]:
authors_stat2 = authors_price.groupby("author_name").agg({"price": "min"})
authors_stat2

             price
author_name
Chekhov        450
Ostrovskiy     290
Turgenev       300

In [11]:
authors_stat3 = authors_price.groupby("author_name").agg({"price": "mean"})
authors_stat3

                  price
author_name
Chekhov      475.000000
Ostrovskiy   330.000000
Turgenev     366.666667

In [13]:
authors_stat = pd.concat([authors_stat1, authors_stat2, authors_stat3], axis=1, ignore_index=True)
authors_stat

               0    1           2
author_name
Chekhov      500  450  475.000000
Ostrovskiy   370  290  330.000000
Turgenev     450  300  366.666667